Tekla.Structures.Analysis.AnalysisPart.#ctor
Initializes a new instance of the Tekla.Structures.Analysis.AnalysisPart class.

Tekla.Structures.Analysis.AnalysisPart.Delete
Deletes an analysis part.
The method is not implemented.